nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_uart.c
	GPIO_PinInit(base, pin, &config);	
}

static void imx_cam_sensor_io_set(GPIO_Type *base, uint32_t pin,bool pullUp)
{
    if (pullUp)
    {
        GPIO_PinWrite(base, pin, 1);
    }
    else
    {
        GPIO_PinWrite(base, pin, 0);
    }
}

uint8_t imx_cam_sensor_scan(struct rt_i2c_bus_device *i2c_bus)
{
	struct rt_i2c_msg msgs;
	rt_uint8_t buf[3] = {0};
	for (uint8_t addr=0x08;addr<=0x77;addr++)
	{
		buf[0] = 0x0; //cmd
		msgs.addr = addr;
		msgs.flags = RT_I2C_WR;
		msgs.buf = buf;
		msgs.len = 1;
		
		if (rt_i2c_transfer(i2c_bus, &msgs, 1) != 0)
		{
			return addr ;
		}
	}
	
	return 0;
}

int imx_cam_sensor_read_reg(struct rt_i2c_bus_device *i2c_bus,rt_uint16_t addr, rt_uint8_t reg, rt_uint8_t *data)
{
	struct rt_i2c_msg msgs[2];
	rt_uint8_t buf[3];
	
	
	buf[0] = reg; //cmd
    msgs[0].addr = addr;
    msgs[0].flags = RT_I2C_WR;
    msgs[0].buf = buf;
    msgs[0].len = 1;
	
	msgs[1].addr = addr;
    msgs[1].flags = RT_I2C_RD|RT_I2C_NO_START;
    msgs[1].buf = data;
    msgs[1].len = 1;
	
//	count = rt_i2c_master_send(i2c_bus,addr,0,buf,1);
//	count = rt_i2c_master_recv(i2c_bus,addr,RT_I2C_NO_START,data,1);
    
	
    if (rt_i2c_transfer(i2c_bus, msgs, 2) != 0)
    {
        return 0 ;
    }
    else
    {
		cam_err("[%s] error\r\n",__func__);
        return -1;
    }
	
}

int imx_cam_sensor_write_reg(struct rt_i2c_bus_device *i2c_bus,rt_uint16_t addr, rt_uint8_t reg, rt_uint8_t data)
{
	struct rt_i2c_msg msgs;
	rt_uint8_t buf[3];

	buf[0] = reg; //cmd
	buf[1] = data;

	msgs.addr = addr;
	msgs.flags = RT_I2C_WR;
	msgs.buf = buf;
	msgs.len = 2;

	
	if (rt_i2c_transfer(i2c_bus, &msgs, 1) == 1)
	{
		return 0;
	}
	else
	{
		cam_err("[%s] error\r\n",__func__);
		return -1;
	}
}

int imx_cam_sensor_readb2_reg(struct rt_i2c_bus_device *i2c_bus,rt_uint16_t addr, rt_uint16_t reg, rt_uint8_t *data)
{
	struct rt_i2c_msg msgs[2];
	rt_uint8_t buf[3];
	
	
	buf[0] = reg >> 8; //cmd
	buf[1] = reg & 0xff;
    msgs[0].addr = addr;
    msgs[0].flags = RT_I2C_WR;
    msgs[0].buf = buf;
    msgs[0].len = 2;
	
	msgs[1].addr = addr;
    msgs[1].flags = RT_I2C_RD|RT_I2C_NO_START;
    msgs[1].buf = data;
    msgs[1].len = 1;
		
    if (rt_i2c_transfer(i2c_bus, msgs, 2) != 0)
    {
        return 0 ;
    }
    else
    {
		cam_err("[%s] error\r\n",__func__);
        return -1;
    }
	
}

int imx_cam_sensor_writeb2_reg(struct rt_i2c_bus_device *i2c_bus,rt_uint16_t addr, rt_uint16_t reg, rt_uint8_t data)
{
	struct rt_i2c_msg msgs;
	rt_uint8_t buf[3];

	buf[0] = reg >> 8; //cmd
	buf[1] = reg & 0xff;
	buf[2] = data;

	msgs.addr = addr;
	msgs.flags = RT_I2C_WR;
	msgs.buf = buf;
	msgs.len = 3;

	
	if (rt_i2c_transfer(i2c_bus, &msgs, 1) == 1)
	{
		return 0;
	}
	else
	{
		cam_err("[%s] error\r\n",__func__);
		return -1;
	}
}

int imx_cam_sensor_cambus_writeb(sensor_t *sensor, uint8_t slv_addr, uint8_t reg_addr, uint8_t reg_data)
{
	struct rt_i2c_bus_device *i2c_bus = (struct rt_i2c_bus_device *)sensor->i2c_bus;
	
	return imx_cam_sensor_write_reg(i2c_bus,slv_addr,reg_addr,reg_data);
}
int imx_cam_sensor_cambus_readb(sensor_t *sensor, uint8_t slv_addr, uint8_t reg_addr, uint8_t *reg_data)
{
	struct rt_i2c_bus_device *i2c_bus = (struct rt_i2c_bus_device *)sensor->i2c_bus;
	
	return imx_cam_sensor_read_reg(i2c_bus,slv_addr,reg_addr,reg_data);
}

int imx_cam_sensor_cambus_writeb2(sensor_t *sensor, uint8_t slv_addr, uint16_t reg_addr, uint8_t reg_data)
{
	struct rt_i2c_bus_device *i2c_bus = (struct rt_i2c_bus_device *)sensor->i2c_bus;
	
	return imx_cam_sensor_writeb2_reg(i2c_bus,slv_addr,reg_addr,reg_data);
}
int imx_cam_sensor_cambus_readb2(sensor_t *sensor, uint8_t slv_addr, uint16_t reg_addr, uint8_t *reg_data)
{
	struct rt_i2c_bus_device *i2c_bus = (struct rt_i2c_bus_device *)sensor->i2c_bus;
	
	return imx_cam_sensor_readb2_reg(i2c_bus,slv_addr,reg_addr,reg_data);
}

int imx_cam_sensor_cambus_readw(sensor_t *sensor, uint8_t slv_addr, uint8_t reg_addr, uint16_t *reg_data)
{
	struct rt_i2c_msg msgs[2];
	rt_uint8_t buf[3];
	struct rt_i2c_bus_device *i2c_bus = (struct rt_i2c_bus_device *)sensor->i2c_bus;
	
	buf[0] = reg_addr; //cmd
    msgs[0].addr = slv_addr;
    msgs[0].flags = RT_I2C_WR;
    msgs[0].buf = buf;
    msgs[0].len = 1;
	
	msgs[1].addr = reg_addr;
    msgs[1].flags = RT_I2C_RD;
    msgs[1].buf = (uint8_t *)reg_data;
    msgs[1].len = 1;
	
    
    if (rt_i2c_transfer(i2c_bus, msgs, 2) != 0)
    {
        return 0 ;
    }
    else
    {
		cam_err("[%s] error\r\n",__func__);
        return -1;
    }
}

int imx_cam_sensor_cambus_writew(sensor_t *sensor, uint8_t slv_addr, uint8_t reg_addr, uint16_t reg_data)
{
	struct rt_i2c_msg msgs;
	rt_uint8_t buf[3];
	struct rt_i2c_bus_device *i2c_bus = (struct rt_i2c_bus_device *)sensor->i2c_bus;
	
	buf[0] = reg_addr; //cmd
	buf[1] = reg_data & 0x00ff;
	buf[2] = reg_data >> 8;
	
	msgs.addr = slv_addr;
	msgs.flags = RT_I2C_WR;
	msgs.buf = buf;
	msgs.len = 3;

	
	if (rt_i2c_transfer(i2c_bus, &msgs, 1) == 1)
	{
		return 0;
	}
	else
	{
		cam_err("[%s] error\r\n",__func__);
		return -1;
	}
}


extern void BOARD_Camera_pwd_io_set(int value);
extern void BORAD_Camera_rst_io_set(int value);
bool imx_cam_sensor_init(struct imxrt_camera *cam)
{
	struct rt_i2c_bus_device *i2c_bus;
	
	//��ʼ������
	scc8660_uart_init();
	memset(&cam->sensor, 0, sizeof(cam->sensor));
	
//	i2c_bus = rt_i2c_bus_device_find(cam->sensor_bus_name);
//	if(i2c_bus == RT_NULL)
//	{
//		cam_err("[%s]driver can not find %s bus\r\n",__func__,cam->sensor_bus_name);
//		return ;
//	}
	cam->sensor.i2c_bus = (uint32_t *)i2c_bus;
	cam->sensor.cambus_readb = imx_cam_sensor_cambus_readb;
	cam->sensor.cambus_writeb = imx_cam_sensor_cambus_writeb;
	cam->sensor.cambus_readw = imx_cam_sensor_cambus_readw;
	cam->sensor.cambus_writew = imx_cam_sensor_cambus_writew;
	cam->sensor.cambus_readb2 = imx_cam_sensor_cambus_readb2;
	cam->sensor.cambus_writeb2 = imx_cam_sensor_cambus_writeb2;
	cam->sensor_addr = 0x21;
	cam->sensor.slv_addr = cam->sensor_addr;

#ifdef 	SOC_IMXRT1170_SERIES
#else	
	CLOCK_SetMux(kCLOCK_CsiMux, 0);
    CLOCK_SetDiv(kCLOCK_CsiDiv, 0);
#endif	

//	//reset camera
//	//power down to low
//	BOARD_Camera_pwd_io_set(0);
//	//reset 
//	BORAD_Camera_rst_io_set(0);
//	rt_thread_delay(10);
//	BORAD_Camera_rst_io_set(1);
//	rt_thread_delay(10);
#if 0	
	cam->sensor_addr = imx_cam_sensor_scan(i2c_bus);
	if (cam->sensor_addr == 0)
	{
		cam->sensor.reset_pol = ACTIVE_HIGH;
		BORAD_Camera_rst_io_set(0);
		rt_thread_delay(10);
		cam->sensor_addr = imx_cam_sensor_scan(i2c_bus);
		if (cam->sensor_addr == 0)
		{
			cam->sensor.pwdn_pol = ACTIVE_HIGH;
			BOARD_Camera_pwd_io_set(1);
			rt_thread_delay(10);
			cam->sensor_addr = imx_cam_sensor_scan(i2c_bus);
			if (cam->sensor_addr == 0)
			{
				cam->sensor.reset_pol = ACTIVE_LOW;
				BORAD_Camera_rst_io_set(1);
				rt_thread_delay(10);
				cam->sensor_addr = imx_cam_sensor_scan(i2c_bus);
				if (cam->sensor_addr == 0)
				{
					cam_err("[%s] can not find any camera device\r\n",__func__);
					return;
				}
			}
		}
	}
#endif	

	//��ȡ����ͷID
	scc8660_get_id(&cam->sensor.chip_id);
	
	if(UART_SCC8660_ID == cam->sensor.chip_id)
	{
		scc8660_init(&cam->sensor);
	}
	
//	imx_cam_sensor_read_reg(i2c_bus,cam->sensor_addr,ON_CHIP_ID, &cam->sensor_id);
//	if(cam->sensor_id == MT9V034_ID)
//	{
//	#ifdef SENSOR_MT9V034
//		mt9v034_init(&cam->sensor);
//	#endif	
//	}
//	else
//	{
//		imx_cam_sensor_read_reg(i2c_bus,cam->sensor_addr,OV_CHIP_ID, &cam->sensor_id);
//		cam_echo("Camera Device id:0x%x\r\n",cam->sensor_id);
//		switch(cam->sensor_id)
//		{
//			case MT9V034_ID:
//				#ifdef SENSOR_MT9V034
//				mt9v034_init(&cam->sensor);
//				#endif
//				break;
//			case OV9650_ID:
//				#ifdef SENSOR_OV9650
//				ov9650_init(&cam->sensor);
//				#endif
//				break;
//			case OV2640_ID:
//				#ifdef SENSOR_OV2640
//				ov2640_init(&cam->sensor);
//				#endif
//				break;
//			case OV7725_ID:
//				#ifdef SENSOR_OV7725
//				ov7725_init(&cam->sensor);
//				#endif
//				break;
//			default:
//				cam_err("[%s] sensor id:0x%2x not support\r\n",__func__,cam->sensor_id);
//				break;
//		}
//	
//	}
	return true;
}

int imxrt_camera_set_framerate(struct imxrt_camera *cam,framerate_t framerate)
{
    if (cam->sensor.framerate == framerate) {
       /* no change */
        return 0;
    }
#ifdef 	SOC_IMXRT1170_SERIES
#else		
	if ((framerate & 0x80000000) && (cam->sensor_id == OV7725_ID))
		CCM->CSCDR3 = framerate & (0x1F<<9);
#endif
    /* call the sensor specific function */
    if (cam->sensor.set_framerate == NULL
        || cam->sensor.set_framerate(&cam->sensor, framerate) != 0) {
        /* operation not supported */
        return -1;
    }

