nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_uart.c
			dmaBase += pCam->sensor.wndX * 2 * pCam->s_irq.linePerFrag;	// apply line window offset
			if (pCam->s_irq.isGray) {
				
				pCam->s_irq.datCurBase = ExtractYFromYuv(dmaBase, pCam->s_irq.datCurBase, (pCam->sensor.wndW * pCam->s_irq.linePerFrag) >> 3);
			} else {
				uint32_t byteToCopy = (pCam->sensor.wndW * pCam->s_irq.linePerFrag) << 1;
				memcpy((void*)pCam->s_irq.datCurBase, (void*)dmaBase, byteToCopy);
				pCam->s_irq.datCurBase += byteToCopy;
			}
		}
		
		if (++pCam->s_irq.dmaFragNdx == pCam->s_irq.fragCnt || (csisr & (3<<19)) == 3<<19 )
		{
			//				 16 doubleWords| ReflashRFF
			pCam->csi_base->CSICR3 = 2<<4		   | 1<<14;
			sync_found = 0;
		
			//send evt to cam thread
			rt_event_send(&frame_event, EVENT_CSI);
	
			if(isToStopCSICommand )
			{
				NVIC_DisableIRQ(CSI_IRQn);
				CSI_Stop(CSI);
				isToStopCSICommand = 0;
				g_csi_int_en = 0;
			}
			else
			{
				
			}

			goto Cleanup;
		}
	}
Cleanup:
	rt_interrupt_leave();
	__DSB(); //__ISB();
	return;
}

void imx_cam_csi_fragmode_calc(struct imxrt_camera *cam) {
	
	cam->s_irq.datBytePerLine = cam->s_irq.dmaBytePerLine = cam->sensor.fb_w * 2;
	if (cam->sensor.pixformat == PIXFORMAT_GRAYSCALE) {
		cam->s_irq.datBytePerLine /= 2;	// only contain Y
		cam->s_irq.isGray = 1;
		cam->sensor.hw_flags.gs_bpp = 1;
	} else {
		cam->s_irq.isGray = 0;
		cam->sensor.hw_flags.gs_bpp = 2;
	}
	if (cam->sensor.fb_w == 0 || cam->sensor.fb_h == 0)
		return;

	// calculate max bytes per DMA frag
	uint32_t dmaBytePerFrag, byteStep, dmaByteTotal;
	uint32_t maxBytePerLine = sizeof(s_dmaFragBufs) / ARRAY_SIZE(s_dmaFragBufs);
	dmaByteTotal = cam->sensor.fb_w * cam->sensor.fb_h * 2;	
	if (cam->sensor.wndX == 0 && cam->sensor.wndY == 0) // (s_irq.isGray)
	{
		dmaBytePerFrag = cam->s_irq.dmaBytePerLine;  // set a minial default value
		for (byteStep = cam->s_irq.dmaBytePerLine; byteStep < maxBytePerLine; byteStep += cam->s_irq.dmaBytePerLine) {
			if (0 == byteStep % 32 )
			{
				// find maximum allowed bytes per frag
				dmaBytePerFrag = (maxBytePerLine / byteStep) * byteStep;
				for (; dmaBytePerFrag >= byteStep; dmaBytePerFrag -= byteStep) {
					if (dmaByteTotal % dmaBytePerFrag == 0)
						break;
				}
				if (dmaBytePerFrag < byteStep) {
					dmaBytePerFrag = byteStep;
					//while (1) {}
				}
				break;
			}
		}
	} 
	else {
		// for window mode, we only accept 1 line per frag
		dmaBytePerFrag = cam->s_irq.dmaBytePerLine;
	}
	cam->s_irq.linePerFrag = dmaBytePerFrag / cam->s_irq.dmaBytePerLine;
	cam->s_irq.dmaBytePerFrag = dmaBytePerFrag;
	cam->s_irq.datBytePerLine = cam->s_irq.isGray ? dmaBytePerFrag / 2 : dmaBytePerFrag;

	// >>> calculate how many lines per fragment (DMA xfer unit)
	uint32_t burstBytes;
	if (!(cam->s_irq.dmaBytePerLine % (8 * 16)))
	{
		burstBytes = 128;
		cam->csi_base->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(3U);
		cam->csi_base->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((2U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	else if (!(cam->s_irq.dmaBytePerLine % (8 * 8)))
	{
		burstBytes = 64;
		cam->csi_base->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(2U);
		cam->csi_base->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((1U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	else
	{
		burstBytes = 32;
		cam->csi_base->CSICR2 = CSI_CSICR2_DMA_BURST_TYPE_RFF(1U);
		cam->csi_base->CSICR3 = (CSI->CSICR3 & ~CSI_CSICR3_RxFF_LEVEL_MASK) | ((0U << CSI_CSICR3_RxFF_LEVEL_SHIFT));
	}
	cam->s_irq.fragCnt = cam->sensor.fb_h / cam->s_irq.linePerFrag;
	// <<<
}


void imx_cam_csi_start_frame(struct imxrt_camera *cam)
{	
	uint32_t start = rt_tick_get_us();
	if(!csi_calc_first) {
		imx_cam_csi_fragmode_calc(cam);
		csi_calc_first = true;
	}
	cam->s_irq.dmaFragNdx = 0;
	cam->s_irq.cnt++;
	// DMA also writes to this cache line, to avoid being invalidated, clean MAIN_FB header.
	DCACHE_CleanByRange((uint32_t)cam->s_irq.base0, 32);
	if (cam->s_irq.isGray || cam->sensor.isWindowing) {
		cam->csi_base->CSIDMASA_FB1 = (uint32_t) s_dmaFragBufs[0];
		cam->csi_base->CSIDMASA_FB2 = (uint32_t) s_dmaFragBufs[1];
	} else {
		cam->csi_base->CSIDMASA_FB1 = cam->s_irq.base0;
		cam->csi_base->CSIDMASA_FB2 = cam->s_irq.base0 + cam->s_irq.dmaBytePerFrag;
	}
	cam->s_irq.datCurBase = cam->s_irq.base0; // + s_sensor.wndY * s_irq.datBytePerLine + s_sensor.wndX * s_sensor.gs_bpp;
	cam->csi_base->CSICR1 = CSICR1_INIT_VAL;
	if (cam->s_irq.dmaBytePerFrag & 0xFFFF0000) {
		
		uint32_t l16 = cam->s_irq.linePerFrag , h16 = cam->s_irq.dmaBytePerLine << 16;
		cam->csi_base->CSIIMAG_PARA = l16 | h16;
	} else {
		cam->csi_base->CSIIMAG_PARA = 1U | cam->s_irq.dmaBytePerFrag << 16;	// set xfer cnt
	}
	__set_PRIMASK(1);
	cam->csi_base->CSISR = cam->csi_base->CSISR;
	g_start = rt_tick_get();
	cam->csi_base->CSICR18 |= 1U<<31;	// start CSI
	cam->csi_base->CSICR1  |= 1<<16;	// must enable SOF iRQ after all the para is initialized
	NVIC_EnableIRQ(CSI_IRQn);
	g_csi_int_en = 1;
	__set_PRIMASK(0);
}

void imx_cam_start_snapshot(struct imxrt_camera *cam)
{
	pCam = cam;
	//start csi
	uint8_t bpp=2;
	int16_t w,h;
	uint32_t size;
	
	w = cam->sensor.isWindowing ? cam->sensor.fb_w : resolution[cam->sensor.framesize][0];
	h = cam->sensor.isWindowing ? cam->sensor.fb_h : resolution[cam->sensor.framesize][1];
	switch (cam->sensor.pixformat) {
        case PIXFORMAT_GRAYSCALE:
            bpp = 1;
            break;
        case PIXFORMAT_YUV422:
        case PIXFORMAT_RGB565:
            bpp = 2;
            break;
        case PIXFORMAT_BAYER:
            bpp = 3;
            break;
        case PIXFORMAT_JPEG:
            // Read the number of data items transferred
            // MAIN_FB()->bpp = (MAX_XFER_SIZE - __HAL_DMA_GET_COUNTER(&DMAHandle))*4;
            break;
		default:
			bpp = 3;
			break;
    }
	
	size = w * h * bpp;

	framebuffer_set_buffers(3);
	imx_cam_csi_start_frame(cam);
}



void imx_cam_sensor_set_contrast(struct imxrt_camera *cam, uint32_t level)
{
	if (cam->sensor.set_contrast != NULL)
		cam->sensor.set_contrast(&cam->sensor,level);
}

void imx_cam_sensor_set_gainceiling(struct imxrt_camera *cam, gainceiling_t gainceiling)
{
	if (cam->sensor.set_gainceiling != NULL && !cam->sensor.set_gainceiling(&cam->sensor, gainceiling))
		cam->sensor.gainceiling = gainceiling;
}

int imx_cam_sensor_set_framesize(struct imxrt_camera *cam, framesize_t framesize)
{
	if(cam->sensor.set_framesize == NULL || cam->sensor.set_framesize(&cam->sensor,framesize) != 0)
		return -1;
	
