nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/sensors/drv_camera_uart.c
	cam->sensor.framesize = framesize;
	
	cam->sensor.fb_w = resolution[framesize][0];
	cam->sensor.fb_h = resolution[framesize][1];
	
	cam->sensor.wndX = 0; cam->sensor.wndY = 0 ; cam->sensor.wndW = cam->sensor.fb_w ; cam->sensor.wndH = cam->sensor.fb_h;

	return 0;
}

void imx_cam_sensor_set_pixformat(struct imxrt_camera *cam, pixformat_t pixformat)
{
	if (cam->sensor.set_pixformat == NULL || cam->sensor.set_pixformat(&cam->sensor,pixformat) != 0)
		return;
	if (cam->sensor.pixformat == pixformat)
		return;
	
	cam->sensor.pixformat = pixformat;
}

void imx_cam_sensor_set_brightness(struct imxrt_camera *cam, int brightness)
{
	if (cam->sensor.set_brightness == NULL || cam->sensor.set_brightness(&cam->sensor, brightness) != 0)
		return;
}

rt_err_t imx_cam_sensor_set_framerate(struct imxrt_camera *cam, int rate)
{
	if (cam->sensor.framerate == rate)
		return RT_ERROR;
	if (rate & 0x80000000)
		CCM->CSCDR3 = rate & (0x1F<<9);
	/* call the sensor specific function */
    if (cam->sensor.set_framerate == NULL
        || cam->sensor.set_framerate(&cam->sensor, rate) != 0) {
        /* operation not supported */
        return RT_ERROR;
    }

    /* set the frame rate */
    cam->sensor.framerate = rate;
	return RT_EOK;
}

void imx_cam_csi_stop(struct rt_camera_device *cam)
{
	cam->status = RT_CAMERA_DEVICE_SUSPEND;
	CSI_Stop(CSI);
	g_csi_int_en = 0;
	NVIC_DisableIRQ(CSI_IRQn);
}

static rt_err_t imx_cam_camera_control(struct rt_camera_device *cam, rt_uint32_t cmd, rt_uint32_t parameter)
{
	struct imxrt_camera *imx_cam = (struct imxrt_camera *)cam->imx_cam;
	switch(cmd)
	{
		case RT_DRV_CAM_CMD_RESET:
			cam->omv_tid = rt_thread_self();
			if(cam->status == RT_CAMERA_DEVICE_RUNING)
			{
				imx_cam_csi_stop(cam);
			}
			imx_cam_reset(imx_cam);
			pCam = (struct imxrt_camera *)cam->imx_cam;
			cam->status = RT_CAMERA_DEVICE_INIT;
			break;
		case RT_DRV_CAM_CMD_SET_FRAMERATE:
			return imxrt_camera_set_framerate(imx_cam, parameter);
		    break;
		case RT_DRV_CAM_CMD_SET_CONTRAST:
			imx_cam_sensor_set_contrast(imx_cam, parameter);
			break;
		case RT_DRV_CAM_CMD_SET_GAINCEILING:
			imx_cam_sensor_set_gainceiling(imx_cam, parameter);
			break;
		case RT_DRV_CAM_CMD_SET_FRAMESIZE:
			return imx_cam_sensor_set_framesize(imx_cam, parameter);
		case RT_DRV_CAM_CMD_SET_PIXFORMAT:
			imx_cam_sensor_set_pixformat(imx_cam, parameter);
			break;
		case RT_DRV_CAM_CMD_SETBRIGHTNESS:
		{
			imx_cam_sensor_set_brightness(imx_cam, parameter);
		}break;
		case RT_DRV_CAM_CMD_SNAPSHOT:
		{
			if(cam->status != RT_CAMERA_DEVICE_RUNING)
			{
				//rt_sem_init(cam->sem,"cam", 0, RT_IPC_FLAG_FIFO);
				imx_cam_start_snapshot((struct imxrt_camera *)cam->imx_cam);
				cam->status = RT_CAMERA_DEVICE_RUNING;
				
			}
			//rest total count 
			//#warning "Enable this, and can not begin twice"
			break;
			
		}
		case RT_DRV_CAM_CMD_SHUTDOWN:
			//imx_cam_csi_stop(cam);
			//rt_event_control(&frame_event,RT_IPC_CMD_RESET,0);
			break;
	}
	
	return RT_EOK;
}

static rt_size_t imx_cam_get_frame_jpeg(struct rt_camera_device *cam, void *frame_ptr)
{
	return 0;
}

#define PRODUCT_PRIO   (RT_MAIN_THREAD_PRIORITY-6)
#define CONSUME_PRIO   (RT_MAIN_THREAD_PRIORITY-5)

// when we use the lvgl, the omv is as a plug-in
// but now we provide a way to pause the lvgl, and 
// the omv concour the panel
static bool lvgl_running = false;
void set_lvgl_running(bool enable){
	lvgl_running = enable;
}

static void framebuffer_update_lcd()
{
#ifdef RT_USING_LCD	
	image_t main_fb_src;
    framebuffer_init_image(&main_fb_src);
    image_t *src = &main_fb_src;
	
	static uint8_t fbIdx = 0;
	
	LCDMonitor_Update(fbIdx++,pCam->s_irq.isGray, pCam->sensor.wndH, pCam->sensor.wndW, (uint32_t)src->data);
#endif	
}

static rt_size_t imx_cam_get_frame(struct rt_camera_device *cam, image_t * image)
{
	static uint32_t ls_prevTick = 0;
	uint32_t s_minProcessTicks = 10;
	
	struct imxrt_camera *imx_cam = (struct imxrt_camera *)cam->imx_cam;
	register rt_ubase_t temp;
	if(JPEG_FB()->enabled)
		framebuffer_update_jpeg_buffer();
	
	if(!lvgl_running)
		framebuffer_update_lcd();
	
	uint32_t diff = rt_tick_get() - ls_prevTick;
	if((JPEG_FB()->enabled)&&(diff < s_minProcessTicks)){
			rt_thread_mdelay(s_minProcessTicks - diff);
	}

	if((pCam->sensor.isWindowing))
	{
		uint32_t win_h = pCam->sensor.wndH;
		uint32_t win_w = pCam->sensor.wndW;
		uint32_t win_x = pCam->sensor.wndX;
		uint32_t win_y = pCam->sensor.wndY;
		// handle the windowing 
		MAIN_FB()->w = win_w;
		MAIN_FB()->h = win_h;
	}else{
		MAIN_FB()->w = pCam->sensor.fb_w;
		MAIN_FB()->h = pCam->sensor.fb_h;		
	}
	MAIN_FB()->pixfmt = pCam->sensor.pixformat;

	vbuffer_t *buffer = NULL;
	while(1)
	{
		if (rt_event_recv(&frame_event, EVENT_CSI,RT_EVENT_FLAG_OR | RT_EVENT_FLAG_CLEAR,
                      RT_WAITING_FOREVER, NULL) == RT_EOK)
		{
			temp = rt_hw_interrupt_disable();
			buffer = framebuffer_get_head(FB_NO_FLAGS);
			
			if(buffer)
			{
				 rt_hw_interrupt_enable(temp);
			 break;
			}
			rt_hw_interrupt_enable(temp);
		}
	}
	
	framebuffer_init_image(image);
	
//	if(!lvgl_running){
//		#ifdef RT_USING_LCD
//		static uint8_t fbIdx = 0;
//		LCDMonitor_Update(fbIdx++,pCam->s_irq.isGray, pCam->sensor.wndH, pCam->sensor.wndW, (uint32_t)buffer->data);
//		#endif
//		
//		//if(JPEG_FB()->enabled)
//		//	framebuffer_update_jpeg_buffer();
//	}
	
	ls_prevTick = rt_tick_get();
	return 0;

}

static const struct rt_camera_device_ops imxrt_cam_ops =
{
    .get_frame_jpeg = imx_cam_get_frame_jpeg,
	.get_frame = imx_cam_get_frame,
	.camera_control = imx_cam_camera_control,
};

//csi timeout handler
void csi_to_handler(void* paramter)
{
	return;
	//struct rt_camera_device *cam = (struct rt_camera_device *)paramter;
	//imx_cam_csi_stop(cam);
	//rt_event_control(&frame_event,RT_IPC_CMD_RESET,0);
}

void camera_clear_by_omv_ide(void)
{
	if (pCam) {
		imx_cam_csi_stop(pCam->rtt_device);
		rt_event_control(&frame_event,RT_IPC_CMD_RESET,0);
		set_lvgl_running(0);
	}
}


#ifndef NO_LCD_MONITOR
uint32_t activeFrameAddr;
uint32_t inactiveFrameAddr;

__attribute__((naked))
uint16_t* LCDMonitor_UpdateLineGray(uint16_t *pLcdFB, uint16_t *pCamFB, uint32_t quadPixCnt) {
	__asm volatile(
		"   push   {r0-r6, ip, lr} \n"  // we found GCC caller does not save these for naked callee!
		"	mov 	r5, #0	  \n "
		"	mov 	r6, #0	  \n "
		"10:	\n "
		"	subs	r2, r2, #1	  \n "
		"	ldr 	r3, [r1], #4	\n "
		"	ldr 	ip, =0xFCFCFCFC    \n "
		"	and 	r3, r3, ip	  \n "
		"	lsr 	r3, r3, #2	  \n "
		"	lsr 	r4, r3, #16    \n "
		"	bfi 	r5, r3, #5, #6	  \n "
		"	bfi 	r6, r4, #5, #6	  \n "
		"	rev16	r3, r3	  \n "
		"	rev16	r4, r4	  \n "
		"	bfi 	r5, r3, #21, #6    \n "
		"	bfi 	r6, r4, #21, #6    \n "
		"	rev16	r3, r3	  \n "
		"	rev16	r4, r4	  \n "
		"	ldr 	ip, =0xFEFE    \n "
		"	and 	r3, r3, ip	  \n "
		"	and 	r4, r4, ip	  \n "
		"	lsr 	r3, r3, #1	  \n "
		"	lsr 	r4, r4, #1	  \n "	
		"	bfi 	r5, r3, #0, #5	  \n "
		"	bfi 	r6, r4, #0, #5	  \n "
		"	rev16	r3, r3	  \n "
		"	rev16	r4, r4		\n "
		"	bfi 	r5, r3, #16,	#5	  \n "
		"	bfi 	r6, r4, #16,	#5	  \n "
		"	rev16	r3, r3	  \n "
		"	rev16	r4, r4	  \n "
		"	bfi 	r5, r3, #11,	#5	  \n "
		"	bfi 	r6, r4, #11,	#5	  \n "
		"	rev16	r3, r3	  \n "
		"	rev16	r4, r4	  \n "	
		"	bfi 	r5, r3, #27,	#5	  \n "
		"	bfi 	r6, r4, #27,	#5	  \n "	
		"	strd	r5, r6, [r0], #8	\n "
		"	bne 	10b    \n "
		"	pop 	{r0-r6, ip, pc}    \n "

